software.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-21 周日 00:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>软件</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="比克曼" />
<link rel="stylesheet" type="text/css" href="css/org-manual.css"/>
</head>
<body>
<div id="content">
<h1 class="title">软件</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d551ea">1. 编程语言</a>
<ul>
<li><a href="#org237c348">1.1. C语言</a>
<ul>
<li><a href="#org89a06dc">1.1.1. 宏操作</a></li>
<li><a href="#orgf89ff60">1.1.2. 位操作</a></li>
<li><a href="#org592c296">1.1.3. 嵌入式</a></li>
</ul>
</li>
<li><a href="#orge09fe0b">1.2. JAVA语言</a></li>
<li><a href="#org8ffe532">1.3. PYTHON语言</a>
<ul>
<li><a href="#orgdf7dcc4">1.3.1. base</a></li>
<li><a href="#org325bf78">1.3.2. numpy</a></li>
<li><a href="#org3cd2e9b">1.3.3. matplotlib</a>
<ul>
<li><a href="#orgf97c963">1.3.3.1. 画XY轴离散点图</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1d551ea" class="outline-2">
<h2 id="org1d551ea"><span class="section-number-2">1</span> 编程语言</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org237c348" class="outline-3">
<h3 id="org237c348"><span class="section-number-3">1.1</span> C语言</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org89a06dc" class="outline-4">
<h4 id="org89a06dc"><span class="section-number-4">1.1.1</span> 宏操作</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><p>
从注释来看是把x转换成字符串。
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #90ee90; font-style: italic;">/*</span>
<span style="color: #90ee90; font-style: italic;"> * Macros to transform values</span>
<span style="color: #90ee90; font-style: italic;"> * into environment strings.</span>
<span style="color: #90ee90; font-style: italic;"> </span><span style="color: #90ee90; font-style: italic;">*/</span>
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">XMK_STR</span>(<span style="color: #ffd700;">x</span>)  #x
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">MK_STR</span>(<span style="color: #ffd700;">x</span>)   XMK_STR(x)
</pre>
</div>

<p>
找到了相关的资料，解读了这个define，还顺便认识了另外两个不常用的
define
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">Conn</span>(<span style="color: #ffd700;">x</span>,<span style="color: #ffd700;">y</span>) x##y
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">ToChar</span>(<span style="color: #ffd700;">x</span>) #@x
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">ToString</span>(<span style="color: #ffd700;">x</span>) #x
</pre>
</div>

<p>
x##y表示什么？表示x连接y，举例说：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">int</span>  <span style="color: #ffd700;">n</span> = Conn(123,456);  <span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#32467;&#26524;&#23601;&#26159;n=123456;</span>
<span style="color: #ffff00; font-size: 105%;">char</span>* <span style="color: #ffd700;">str</span> = Conn(<span style="color: #ffa07a;">"asdf"</span>, <span style="color: #ffa07a;">"adf"</span>)<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#32467;&#26524;&#23601;&#26159; str = "asdfadf";</span>
</pre>
</div>

<p>
再来看#@x，其实就是给x加上单引号，结果返回是一个const char。举例说：
char a = ToChar(1);结果就是a='1';做个越界试验char a=ToChar(123);结
果是a='3'; 但是如果你的参数超过四个字符，编译器就给给你报错了！
error C2015: too many characters in constant; 最后看看#x,估计你也明
白了，他是给x加双引号
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">char</span>* <span style="color: #ffd700;">str</span> = ToString(123132);<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#23601;&#25104;&#20102;str="123132";</span>
</pre>
</div></li>
<li><p>
宏调试接口
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #87cefa; text-decoration: underline;">#pragma</span> diag_suppress 174 <span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#25233;&#21046;&#35686;&#21578;</span>
<span style="color: #87cefa; text-decoration: underline;">#ifdef</span> DEBUG
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #ffd700;">printfdbg</span> printf
<span style="color: #87cefa; text-decoration: underline;">#else</span>
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #ffd700;">printfdbg</span> /                             \
    /printfdbg 
<span style="color: #87cefa; text-decoration: underline;">#endif</span>
</pre>
</div></li>
<li><p>
可变参宏函数
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#21487;&#21464;&#21442;&#23439;&#20989;&#25968;&#23450;&#20041;</span>
<span style="color: #87cefa; text-decoration: underline;">#define</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">HAL_FUN</span>(<span style="color: #ffd700;">FUN_NAME</span>, ...)   \
    FUN_NAME(__VA_ARGS__);
<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">1&#21442;&#25968;&#20989;&#25968;&#23450;&#20041;</span>
<span style="color: #ffff00; font-size: 105%;">void</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">funTest1</span>(<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">a</span>)
{
    printf (<span style="color: #ffa07a;">"a:%d\n"</span>, a);
}
<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">2&#21442;&#25968;&#20989;&#25968;&#23450;&#20041;</span>
<span style="color: #ffff00; font-size: 105%;">void</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">funTest1</span>(<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">a</span>, <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">b</span>)
{
    printf (<span style="color: #ffa07a;">"sum:%d\n"</span>, a+b);
}
<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#35843;&#29992;&#23454;&#20363;</span>
<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">main</span>(<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">argc</span>, <span style="color: #ffff00; font-size: 105%;">char</span>* <span style="color: #ffd700;">argv</span>[])
{
    HAL_FUN(funTest1, 2);
    HAL_FUN(funTest1, 1, 3);
    <span style="color: #ffb6c1; font-size: 105%;">return</span> 0;
}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgf89ff60" class="outline-4">
<h4 id="orgf89ff60"><span class="section-number-4">1.1.2</span> 位操作</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><p>
将最右侧0改为1：
</p>
<div class="org-src-container">
<pre class="src src-c">x|(x+1) 
</pre>
</div></li>
<li><p>
计算绝对值
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">abs</span>( <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">x</span> ) 
{
    <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">y</span> ;
    y = x &gt;&gt; 31 ;
    <span style="color: #ffb6c1; font-size: 105%;">return</span> (x^y)-y ;<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">or: (x+y)^y</span>
}
</pre>
</div></li>
<li><p>
符号函数
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">sign</span>(<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">x</span>)
{
    <span style="color: #ffb6c1; font-size: 105%;">return</span> (x&gt;&gt;31) | (<span style="color: #ffff00; font-size: 105%;">unsigned</span>(-x))&gt;&gt;31 ;<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">x=-2^31&#26102;&#22833;&#36133;(^&#20026;&#24130;)</span>
}
</pre>
</div>
<ol class="org-ol">
<li>sign(x) = -1, 则x&lt;0;</li>
<li>sign(x) = 0, 则x==0 ;</li>
<li>sign(x) = 1, 则x&gt;0</li>
</ol></li>
<li><p>
三值比较
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">cmp</span>( <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">x</span>, <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">y</span> )
{
    <span style="color: #ffb6c1; font-size: 105%;">return</span> (x&gt;y)-(x-y) ;
}
</pre>
</div>
<ol class="org-ol">
<li>cmp(x,y) = -1, 则x&lt;y;</li>
<li>cmp(x,y) = 0, 则x==y;</li>
<li>cmp(x,y) = 1, 则x &gt; y；</li>
</ol></li>
<li><p>
不使用第三方交换x,y
</p>
<div class="org-src-container">
<pre class="src src-c">x ^= y ; y ^= x ; x ^= y ;
x = x+y ; y = x-y ; x = x-y ;
x = x-y ; y = y+x ; x = y-x ;
x = y-x ; x = y-x ; x = x+y ; 
</pre>
</div></li>
<li><p>
统计1位的数量
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">pop</span>(<span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #ffd700;">x</span>)
{
    x = x-((x&gt;&gt;1)&amp;0x55555555) ;
    x = (x&amp;0x33333333) + ((x&gt;&gt;2) &amp; 0x33333333 ) ;
    x = (x+(x&gt;&gt;4)) &amp; 0x0f0f0f0f ;
    x = x + (x&gt;&gt;8) ;
    x = x + (x&gt;&gt;16) ;
    <span style="color: #ffb6c1; font-size: 105%;">return</span> x &amp; 0x0000003f ;
}
</pre>
</div></li>
<li><p>
位反转
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">rev</span>(<span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #ffd700;">x</span>)
{
    x = (x &amp; 0x55555555) &lt;&lt; 1 | (x&gt;&gt;1) &amp; 0x55555555 ;
    x = (x &amp; 0x33333333) &lt;&lt; 2 | (x&gt;&gt;2) &amp; 0x33333333 ;
    x = (x &amp; 0x0f0f0f0f) &lt;&lt; 4 | (x&gt;&gt;4) &amp; 0x0f0f0f0f ;
    x = (x&lt;&lt;24) | ((x&amp;0xff00)&lt;&lt;8) | ((x&gt;&gt;8) &amp; 0xff00) | (x&gt;&gt;24) ;
    <span style="color: #ffb6c1; font-size: 105%;">return</span> x ;
}
</pre>
</div></li>
<li><p>
二进制码到GRAY码的转换
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">B2G</span>(<span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #ffd700;">B</span> )
{
    <span style="color: #ffb6c1; font-size: 105%;">return</span> B ^ (B&gt;&gt;1) ;
}
</pre>
</div></li>
<li><p>
GRAY码到二进制码
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">G2B</span>(<span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #ffd700;">G</span>)
{
    <span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #ffd700;">B</span> ;
    B = G ^ (G&gt;&gt;1) ;
    B = G ^ (G&gt;&gt;2) ;
    B = G ^ (G&gt;&gt;4) ;
    B = G ^ (G&gt;&gt;8) ;
    B = G ^ (G&gt;&gt;16) ;
    <span style="color: #ffb6c1; font-size: 105%;">return</span> B ;
}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org592c296" class="outline-4">
<h4 id="org592c296"><span class="section-number-4">1.1.3</span> 嵌入式</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><p>
printf调试：可以如下步骤
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #87cefa; text-decoration: underline;">#include</span> <span style="color: #ffa07a;">"uart.h"</span><span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#20018;&#21475;&#21457;&#36865;&#21333;&#20010;&#23383;&#31526;&#30340;API</span>
<span style="color: #87cefa; text-decoration: underline;">#include</span> <span style="color: #ffa07a;">"stdio.h"</span><span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#37324;&#38754;&#26377;FILE&#32467;&#26500;&#20307;&#22768;&#26126;</span>
<span style="color: #87cefa; text-decoration: underline;">#pragma</span> import(__use_no_semihosting_swi)<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#21322;&#20027;&#26426;&#27169;&#24335;</span>
<span style="color: #ffb6c1; font-size: 105%;">struct</span> <span style="color: #ffff00; font-size: 105%;">__FILE</span><span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">stdio.h&#37324;&#38754;&#30340;FILE&#32467;&#26500;&#20307;&#22768;&#26126;&#38656;&#35201;</span>
{
  <span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">handle</span>;
};
<span style="color: #ffff00; font-size: 105%;">FILE</span> <span style="color: #ffd700;">__stdout</span>, <span style="color: #ffd700;">__stderr</span>;<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">&#36873;&#29992;&#65292;&#22914;&#26524;&#38656;&#35201;&#20998;&#21035;&#36755;&#20986;</span>

<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #1e90ff; font-size: 105%; font-weight: bold;">fputc</span>(<span style="color: #ffff00; font-size: 105%;">int</span> <span style="color: #ffd700;">ch</span>, <span style="color: #ffff00; font-size: 105%;">FILE</span>* <span style="color: #ffd700;">f</span>)<span style="color: #90ee90; font-style: italic;">//</span><span style="color: #90ee90; font-style: italic;">printf&#26368;&#32456;&#35843;&#29992;&#30340;&#25509;&#21475;</span>
{
  uart_put((<span style="color: #ffff00; font-size: 105%;">unsigned</span> <span style="color: #ffff00; font-size: 105%;">char</span>)ch);
  <span style="color: #ffb6c1; font-size: 105%;">return</span> ch;
}
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge09fe0b" class="outline-3">
<h3 id="orge09fe0b"><span class="section-number-3">1.2</span> JAVA语言</h3>
</div>
<div id="outline-container-org8ffe532" class="outline-3">
<h3 id="org8ffe532"><span class="section-number-3">1.3</span> PYTHON语言</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgdf7dcc4" class="outline-4">
<h4 id="orgdf7dcc4"><span class="section-number-4">1.3.1</span> base</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><p>
字符串转换为变量。
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffd700;">var</span> = <span style="color: #ffa07a;">"This is a string"</span>
<span style="color: #ffd700;">varName</span> = <span style="color: #ffa07a;">'var'</span>
<span style="color: #ffd700;">s</span>= <span style="color: #87cefa; text-decoration: underline;">locals</span>()[varName]
<span style="color: #ffd700;">s2</span>=<span style="color: #87cefa; text-decoration: underline;">vars</span>()[varName]
<span style="color: #ffb6c1; font-size: 105%;">print</span>(s)
<span style="color: #ffb6c1; font-size: 105%;">print</span>(s2)
<span style="color: #ffb6c1; font-size: 105%;">print</span>(<span style="color: #87cefa; text-decoration: underline;">eval</span>(varName))
</pre>
</div></li>
<li><p>
添加个人库: 比如当前工作路径下有./lib/File/filecsv.py , 然后就可以直接使
用filecsv里面的函数了。
</p>
<div class="org-src-container">
<pre class="src src-python">sys.path.append(<span style="color: #ffa07a;">'./lib'</span>)
<span style="color: #ffb6c1; font-size: 105%;">from</span> File.file_csv <span style="color: #ffb6c1; font-size: 105%;">import</span> *
</pre>
</div></li>
<li>重新载入模块：比如重新加载filecsv.py。
<ol class="org-ol">
<li>导入sys，imp库，import sys，imp</li>
<li>查看已经导入的库，sys.modules</li>
<li>找到filecsv库的字符</li>
<li>重新导入模块，imp.reload(sys.modules['filecsv'])</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org325bf78" class="outline-4">
<h4 id="org325bf78"><span class="section-number-4">1.3.2</span> numpy</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>array矩阵的max和min静态属性：比如array矩阵data=array([[1, 5, 3],
[8, 6, 1], [9, 0, 4], [4, 6, 5]]), data.min(0) 和data.max(0)是从每
列中获取的min和max，组成一个向量，data.min(1) 和data.max(1)是从每行
中获得min和max；</li>
<li>指数e：numpy.exp()可以表示，但是是函数，math.exp()也是，scipy.exp()
也是，numpy.e和math.e和scipy.e则是一个float型量了。</li>
<li>复数：可以表示成1+3j，3和j之间不能相隔，3必须为实数不能是符号，j必
须在3之后，也可以使用numpy.complex(1, 3)构成1+3j, 同理也就可以构成
numpy.complex(1, numpy.pi)即\(e^{1+pi j}\)，复数的角度用
numpy.angle()计算</li>
</ul>
</div>
</div>
<div id="outline-container-org3cd2e9b" class="outline-4">
<h4 id="org3cd2e9b"><span class="section-number-4">1.3.3</span> matplotlib</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
此包注意用于画图
</p>
</div>
<div id="outline-container-orgf97c963" class="outline-5">
<h5 id="orgf97c963"><span class="section-number-5">1.3.3.1</span> 画XY轴离散点图</h5>
<div class="outline-text-5" id="text-1-3-3-1">
<ol class="org-ol">
<li>先获得x,y的取值范围，比如x=numpy.arange(0, 10), y=numpy.arange(3,
10), 其个数要一致；</li>
<li>倒入画图包：import matplotlib.pyplot as plt；</li>
<li>开始画图：plt.plot(x, y, 'o-'), 第3个参数用于对点进行标注；</li>
<li>设置标题：plt.title('x, y test')</li>
<li>设置X轴说明：plt.xlabel('x label')</li>
<li>设置y轴说明：plt.ylabel('y label')</li>
<li>显示图：plt.show()</li>
</ol>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 比克曼</p>
<p class="email">Email: <a href="mailto:bitman@163.com">bitman@163.com</a></p>
<p class="date">Created: 2019-04-21 周日 00:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
